<a href="https://colab.research.google.com/github/ShreePurvaja/Data-Science-Notes/blob/main/Pandas_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [56]:
 import pandas as pd

In [57]:
veg=pd.Series({'potato':10,'carrot':20,'brinjal':30,'radish':40,'tomato':50})
veg

potato     10
carrot     20
brinjal    30
radish     40
tomato     50
dtype: int64

In [3]:
veg.values

array([10, 20, 30, 40, 50])

In [4]:
veg.index

Index(['potato', 'carrot', 'brinjal', 'radish', 'tomato'], dtype='object')

In [7]:
veg.shape

(5,)

In [9]:
veg['potato'] #using label

np.int64(10)

In [11]:
veg[3] #using index number

<ipython-input-11-19938187b495>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  veg[3] #using index number

np.int64(40)

In [12]:
veg['potato':'brinjal'] #using slicing

potato     10
carrot     20
brinjal    30
dtype: int64

In [13]:
veg[0:3] #using slicing index

potato     10
carrot     20
brinjal    30
dtype: int64

In [14]:
veg[:'tomato']

potato     10
carrot     20
brinjal    30
radish     40
tomato     50
dtype: int64

In [15]:
veg['brinjal':]

brinjal    30
radish     40
tomato     50
dtype: int64

In [16]:
veg[1::2]#using intervals for slicing

carrot    20
radish    40
dtype: int64

#iloc/loc

#loc : label based indexing

#iloc : position based indexing

In [17]:
# loc

veg['brinjal':'tomato']

brinjal    30
radish     40
tomato     50
dtype: int64

In [18]:
# iloc

veg[1:4]

carrot     20
brinjal    30
radish     40
dtype: int64

In [19]:
veg >8 #boolean output

potato     True
carrot     True
brinjal    True
radish     True
tomato     True
dtype: bool

In [20]:
veg[veg>20] #filtered output

brinjal    30
radish     40
tomato     50
dtype: int64

In [22]:
veg.head() #default top 5 elements

potato     10
carrot     20
brinjal    30
radish     40
tomato     50
dtype: int64

In [23]:
veg.head(2) # top 2 elements

potato    10
carrot    20
dtype: int64

In [24]:
veg.tail() #default last 5 elaements

potato     10
carrot     20
brinjal    30
radish     40
tomato     50
dtype: int64

In [25]:
veg.tail(3)

brinjal    30
radish     40
tomato     50
dtype: int64

In [26]:
veg[2:5] #to fecth the specific range

brinjal    30
radish     40
tomato     50
dtype: int64

In [27]:
# to check any values belong to the series or not

veg.isin([100])

potato     False
carrot     False
brinjal    False
radish     False
tomato     False
dtype: bool

In [28]:
veg.isin([30]) # shows true for the matching values

potato     False
carrot     False
brinjal     True
radish     False
tomato     False
dtype: bool

In [29]:
veg[veg.isin([30])] #extract the exact values

brinjal    30
dtype: int64

In [30]:
new=pd.Series(list('abcde'*2))
new

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
9    e
dtype: object

#unique : name of the unique records

# nunique : number of unique records in the data

# value_counts : count of the unique records with their occurrences

In [31]:
new.unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [32]:
new.nunique()

5

In [33]:
new.value_counts()

a    2
b    2
c    2
d    2
e    2
Name: count, dtype: int64

In [34]:
# dealing with duplicates

new.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [35]:
new[new.duplicated()]

5    a
6    b
7    c
8    d
9    e
dtype: object

In [36]:
new.drop_duplicates()

0    a
1    b
2    c
3    d
4    e
dtype: object

# sorting the data

# sort_values,sort_index

In [37]:
veg.sort_values()

potato     10
carrot     20
brinjal    30
radish     40
tomato     50
dtype: int64

In [38]:
new.sort_values()

0    a
5    a
1    b
6    b
2    c
7    c
3    d
8    d
4    e
9    e
dtype: object

In [39]:
new.sort_index()

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
9    e
dtype: object

In [40]:
veg.sort_index()

brinjal    30
carrot     20
potato     10
radish     40
tomato     50
dtype: int64

In [41]:
import numpy as np

In [42]:
# dealing with missing datas
x=pd.Series([2,3,4,5,np.nan,6,np.nan,3,np.nan])
x

0    2.0
1    3.0
2    4.0
3    5.0
4    NaN
5    6.0
6    NaN
7    3.0
8    NaN
dtype: float64

In [43]:
x.isnull() #gives o/p in boolean values

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7    False
8     True
dtype: bool

In [44]:
x.notnull() #oppsoite opp isnull

0     True
1     True
2     True
3     True
4    False
5     True
6    False
7     True
8    False
dtype: bool

In [46]:
x.isna().sum()

np.int64(3)

In [49]:
x.fillna(2.5)

0    2.0
1    3.0
2    4.0
3    5.0
4    2.5
5    6.0
6    2.5
7    3.0
8    2.5
dtype: float64

In [50]:
x.fillna(x.mean())

0    2.000000
1    3.000000
2    4.000000
3    5.000000
4    3.833333
5    6.000000
6    3.833333
7    3.000000
8    3.833333
dtype: float64

In [51]:
# ffill() bfill()

x.ffill()

0    2.0
1    3.0
2    4.0
3    5.0
4    5.0
5    6.0
6    6.0
7    3.0
8    3.0
dtype: float64

In [52]:
x.bfill()

0    2.0
1    3.0
2    4.0
3    5.0
4    6.0
5    6.0
6    3.0
7    3.0
8    NaN
dtype: float64

In [53]:
x.dropna()

0    2.0
1    3.0
2    4.0
3    5.0
5    6.0
7    3.0
dtype: float64

In [54]:
check=pd.Series(['gowtham','purvaja','classy','akshitaa'])
check

0     gowtham
1     purvaja
2      classy
3    akshitaa
dtype: object

In [55]:
check.map(lambda x:len(x))

0    7
1    7
2    6
3    8
dtype: int64